spec/dummy/rails_app/app/controllers/flows_controller.rb

SELECT "flows".* FROM "flows"
---
  def index
    @flows = Flow.all

INSERT INTO "flows" ("name", "definition", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Test"], ["definition", "caca"], ["created_at", "2017-06-22 01:59:34.881436"], ["updated_at", "2017-06-22 01:59:34.881436"]]
---
  def create
    @flow = Flow.new(flow_params)

    if @flow.save

UPDATE "flows" SET "name" = ?, "definition" = ?, "updated_at" = ? WHERE "flows"."id" = ?  [["name", "Sequence"], ["definition", "concurrence\r\n    alice _\r\n    bob _"], ["updated_at", "2017-06-22 02:05:07.582768"], ["id", 1]]
---
  def update
    if @flow.update(flow_params)

SELECT  "flows".* FROM "flows" WHERE "flows"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_flow
      @flow = Flow.find(params[:id])